In [1]:
import pandas as pd
import numpy as np
import pickle

In [3]:
data = pd.read_csv("hiring.csv")
data.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [9]:
#Check missing values 
data.isnull().sum()

experience         0
test_score         0
interview_score    0
salary             0
dtype: int64

In [8]:
#Handling missing values 
data["experience"].fillna(0 , inplace=True)
data["test_score"].fillna(data["test_score"].mean() , inplace = True)

In [12]:
# Feature selection 
X = data.iloc[: , :3]
y= data.iloc[: , -1 :]

In [13]:
# Function for converting words into numbers
def data_conversion(word):
    my_dict = {"one" : 1 , "two":2 , "three":3 , "four":4 , "five":5 ,
               "six" : 6 , "seven":7 , "eight":8 , "nine":9 , "ten" :10 ,
               "eleven":11 , "twelve":12 , 0:0 }
    return my_dict[word]

In [14]:
X['experience'] = X['experience'].apply(lambda x : data_conversion(x))

In [15]:
X.head()

   experience  test_score  interview_score
0           0         8.0                9
1           0         8.0                6
2           5         6.0                7
3           2        10.0               10
4           7         9.0                6

In [16]:
# Dataframe conversion
df = pd.concat([X,y] , axis=1)

In [17]:
df

   experience  test_score  interview_score  salary
0           0    8.000000                9   50000
1           0    8.000000                6   45000
2           5    6.000000                7   60000
3           2   10.000000               10   65000
4           7    9.000000                6   70000
5           3    7.000000               10   62000
6          10    7.857143                7   72000
7          11    7.000000                8   80000

In [19]:
df.dtypes

experience           int64
test_score         float64
interview_score      int64
salary               int64
dtype: object

In [20]:
# Save
df.to_csv('clean-hiring.csv')

In [23]:
# fit the model
from sklearn.linear_model import LinearRegression
clf = LinearRegression()
clf.fit(X,y)
clf.score(X,y)

0.9639958361860579

In [33]:
# Save a model
pickle.dump(clf,open('model.pkl' , 'wb'))

In [35]:
# Load a model
model = pickle.load(open('model.pkl' , 'rb'))
print(model.predict([[2,9,8]]))

[[57684.84318766]]

C:\Users\Samruddhi\AppData\Roaming\Python\Python311\site-packages\sklearn\base.py:465: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(